
import java.util.Random;
import java.util.Scanner;

public class Narray {
    // Задача 1:
//           1.1 Создать двумерный массив, заполнить его случайными числами.
//           1.2 Добавить к каждому значению число, которое пользователь будет вводить с консоли.
//           1.3 Найти сумму всех получившихся элементов и вывести в консоль.
//           Задача 2:
//   Создать программу для раскраски шахматной доски с помощью цикла. Создать
//   двумерный массив String 8х8. С помощью циклов задать элементам массива значения
//   B(Black) или W(White). При выводе результат работы программы должен быть
//   следующим:
//   W B W B W B W B
//   B W B W B W B W
//   W B W B W B W B
//   B W B W B W B W
//   W B W B W B W B
//   B W B W B W B W
//   W B W B W B W B
//   B W B W B W B W


    public static void main(String[] args) {
 //       int[][] array = new int[3][3];
 //       Random random = new Random();
 //       for (int i = 0; i < array.length; i++) {
 //           for (int j = 0; j < array[i].length; j++) {
 //               array[i][j] = random.nextInt(10, 21);
 //               System.out.print(array[i][j] + " ");
 //           }
 //           System.out.println();
 //       }
 //       System.out.println("Введите число:");
 //       Scanner scanner = new Scanner(System.in);
 //       int addnum = scanner.nextInt();
 //       int sumarr= 0;
 //       for (int i = 0; i < array.length; i++) {
 //           for (int j = 0; j < array[i].length; j++) {
 //               array[i][j] += addnum;
 //               System.out.print(array[i][j] + " ");
 //               sumarr += array[i][j];
 //           }
 //           System.out.println();
 //       }
 //       System.out.println("Сумма всех элементов массива : ");
 //       System.out.print(sumarr);
 //   }
// String [][] chess = new String[8][8];
//     for (int i = 0; i < chess.length ; i++) {
//         for (int j = 0; j <  chess.length ; j++) {
//             if ((i+j) % 2 == 0){
//                 chess[i][j] = "W";
//             }else{
//                 chess[i][j] = "B";
//             }
//             System.out.print(chess[i][j] + " ");
//         }
//         System.out.println();
//     }

        }
}